tutorials/multiRegion/CHT/vacuumFurnace/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    mapped
    {
        type            coupledTemperature;
        value           $internalField;
        qrNbr           qr;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
