tutorials/multiRegion/CHT/vacuumFurnace/system/fluid/fvSolution.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;

        smoother         GaussSeidel;
        maxIter          100;
    }

    "(U|h|e|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
        minIter         1;
    }

    "Ii.*"
    {
        $p_rgh;
        tolerance       1e-7;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol         0;
    }

    "(U|h|e|k|omega)Final"
    {
        $U;
        relTol         0;
    }
}

PIMPLE
{
    flow off;
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 2;
    nCorrectors     2;
}

relaxationFactors
{
    equations
    {
        ".*"  1;
    }
}

// ************************************************************************* //
